#Library "FakeUsers" from filcher2011
import random

class Fu:
    def __init__(self):
        self.name_m = ['Андрей','Альберт','Стасислав','Максим','Олег','Василий','Валентин',
                  'Александр','Алексей','Матвей','Денис','Ян','Семён','Эльдар','Филипп',
                  'Павел','Евгений','Ильдар','Константин','Николай','Елизар','Роман','Никита',
                  'Дмитрий','Петр','Юрий','Всеволод','Степан','Виктор','Марк']
        
        self.name_f = ['Анна','Анастасия','Стефания','Арина','Алина','Наталья','Татьяна',
                  'Елизавета','Марина','Мария','Кира','Надежда','Евгения','Александра',
                  'Гульнара','Кристина','Ольга','Елена','Светлана','Яна','Ульяна']
        
        self.surname_m = ['Иванов','Петров','Сухарков','Денисов','Харимов','Жаровцев','Филатов',
                     'Юрщенко','Либрасов','Кирокимов','Евдокимов','Смирнов','Элизаров',
                     'Вадмиран','Щербаков','Унгитин','Никитин','Некрасов','Батутин',
                     'Свободницин','Тресков','Северный','Матсукин','Зарецкий','Пиров',
                     'Романов','Жилицин','Бюстиков','Черныгласов','Челночко','Уфинский',
                     'Красов','Белов','Титов','Япринко','Цистенский','Ярошенко']
        
        self.surname_f = ['Яркова','Петрова','Иванова','Смирнова','Женченко','Филатова',
                     'Шишкатова','Ликрасова','Древесная','Щукина','Метрова','Ильнасова',
                     'Утринская','Бустикова','Жизниченко','Ткаченко','Патронова','Денисова',
                     'Свердлович','Вискатова','Паркова','Бытрякова','Чернолесная','Жаргонова',
                     'Шишкина','Яковлева','Волгоградская','Князева','Титанова','Горланова','Сеткина',
                     'Пинаева','Дудкина']

        self.num_part1 = ['950','941','990','121','003',
                    '472','996','119','532','799','761']
        
        self.num_part2 = ['7808853','3457285','8930055','1314300','5437840','1117593','5359902','3297583',
                     '5539009','4625678','3345319','7746363']
        
        self.addres = ['Грибоедова','Ленина','Жаргонская','Сосоновая','Еловая',
                  'Пугачева','Комунистическая','Социалистическая','Дектярёва','Гагарина',
                  'Черная','Победителей','Мира','Малеева','Захарова', '20 октября']
        
    def fakename_male(self):
        fakenm = random.randint(0, len(self.name_m) -1)
        fakesm = random.randint(0, len(self.surname_m) -1)
        return(f'{self.name_m[fakenm]} {self.surname_m[fakesm]}')
    
    def fakename_female(self):
        fakenf = random.randint(0, len(self.name_f) -1)
        fakesf = random.randint(0, len(self.name_f) -1)
        return(f'{self.name_f[fakenf]} {self.surname_f[fakesf]}')

    def fakenumber(self):
        fakenum1 = random.randint(0, len(self.num_part1) -1)
        fakenum2 = random.randint(0, len(self.num_part2) -1)
        return(f'+7{self.num_part1[fakenum1]}{self.num_part2[fakenum2]}')
    
    def fakeaddres(self):
        fakeaddres = random.randint(0, len(self.addres) -1)
        return(f'ул. {self.addres[fakeaddres]} {random.randint(1, 120)}')
    
if __name__ == '__main__':
    fu = Fu()